##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения с остатком.

x = int(input())
y = int(input())
print('summa:',x+y,'raznica:',x-y,'delenie:',x/y,'proizvedenie:',x*y)
print('delenie:',x//y,x%y,x**(x%y))
